Courses/4420/Lectures/Fortification/fortify-lab.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-14 Mon 21:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lab: Config and Pruning and Grafting</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Lab: Config and Pruning and Grafting</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org44c0d17">1. Overview</a>
<ul>
<li><a href="#orgd2ed61a">1.1. Objectives</a></li>
<li><a href="#orge8aad33">1.2. Background</a></li>
<li><a href="#org94840c3">1.3. Prerequisite: Install a Modifiable Linux</a></li>
</ul>
</li>
<li><a href="#orgec06dbf">2. Tasks</a>
<ul>
<li><a href="#org876b23e">2.1. Task:  DAC Examples</a></li>
<li><a href="#org002cd93">2.2. Task:  AppArmor and Google Chrome</a></li>
<li><a href="#org56776b3">2.3. Task: Examine sudoers, SUID Programs and Scripts</a></li>
<li><a href="#orga04ddf9">2.4. Task: Prune Installed Software</a></li>
<li><a href="#orga716df0">2.5. Task: Add System Log  Analyses</a></li>
</ul>
</li>
<li><a href="#orgaa37f26">3. Optional Bonus Tasks</a>
<ul>
<li><a href="#org0fc6465">3.1. Task: Revive Bastille Linux Script</a></li>
<li><a href="#org1a4dfc5">3.2. Task: Add Rootkit Detection</a></li>
<li><a href="#orgc53fd87">3.3. Task: [Devious] Rootkit Installation</a></li>
</ul>
</li>
<li><a href="#org5747ff7">4. Submission</a></li>
<li><a href="#org1775b1d">5. References</a></li>
<li><a href="#org75d0481">6. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-org44c0d17" class="outline-2">
<h2 id="org44c0d17"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
Millions of machines connected to the Internet are personal machines
running Windows and Linux, with little supervision from system
administrators.  These have become targets of script kiddies. The
lectures on Config and Fortification and the associated lab
experiments are intended to help configure and fortify personal
systems running Linux.
</p>
</div>

<div id="outline-container-orgd2ed61a" class="outline-3">
<h3 id="orgd2ed61a"><span class="section-number-3">1.1</span> Objectives</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This lab deals with a few config and fortification steps, postponing
hardening etc. to later labs.
</p>

<ol class="org-ol">
<li>Recognize that out of the box installations of OS are insecure.</li>

<li>Examine a Linux installation for what needs to be pruned.  Reducing
the installed footprint is considered a reduction of attack
surface.</li>

<li>We also need to be proactive in observing suspicious events and
take action.</li>
</ol>
</div>
</div>

<div id="outline-container-orge8aad33" class="outline-3">
<h3 id="orge8aad33"><span class="section-number-3">1.2</span> Background</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>This lab is not net-centric; so there is no need for the NetUtils
setup.</li>

<li>This lab asks for a certain number of fixes in the categories of
(i) properly configured, and (ii) fortified,  (iii) postponing
hardening to a later lab.</li>

<li>Write the fixes you suggest as a bash script named
<code>configProperly.sh</code> that can be applied by root.  Include these
scripts as appendices to the lab report.  These scripts can include
commands such as <code>wget URL</code> or <code>apt-get install/remove package</code>.
You are welcome to use a scripting language other than <code>bash</code>; change
the file name extension accordingly.</li>

<li>Should you be unable to find such fixes, report on what you
discovered, and stake a claim that the Linux distribution you chose
was "so perfect".  If we discover otherwise, you will earn
corresponding negative points.</li>
</ol>
</div>
</div>

<div id="outline-container-org94840c3" class="outline-3">
<h3 id="org94840c3"><span class="section-number-3">1.3</span> Prerequisite: Install a Modifiable Linux</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Install a Linux distribution of your choice, that you are able to
modify at will.
<ol class="org-ol">
<li>This can be the multiboot USBD you created in an earlier lab.
You will need to mount the system rw (read-and-write).  The
so-called frugal-install can be mounted rw, but requires
know-how not covered in the lectures.</li>
<li>The ISO loop-mount based installs will-not do.</li>
<li>The easiest is to install an Ubuntu family distro, onto a USBD
<b>as if it is a HDD</b>.  You will need a USB drive of 8 GB or
higher capacity.</li>
<li>Should you wish to work with non-Ubuntu distros, adapt the
details given below appropriately.</li>
</ol></li>

<li>Establish at least 5 ordinary users with names and passwords of
your choice.  Learn how to to do this as a script.  Include the
script in your submission.</li>

<li>We will refer to this installation as LXU.  Boot the PC into LXU.
Login as needed.  Login as an ordinary user or as root.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgec06dbf" class="outline-2">
<h2 id="orgec06dbf"><span class="section-number-2">2</span> Tasks</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org876b23e" class="outline-3">
<h3 id="org876b23e"><span class="section-number-3">2.1</span> Task:  DAC Examples</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Take five examples as-is from LXU and explain file and process
ownership DAC ideas.</li>

<li>Find and report all files with peculiar permissions.  Examples: (i)
no permissions given <code>--- --- ---</code>, (ii) executable but not
readable, (iii) readable for group and others but not the owner,
(iv) unsearchable directories, etc.</li>

<li>Files and directories whose names begin with a dot are unlisted by
<code>ls</code> unless <code>-a</code> flag is used.  Find and report all such files and
directories whose size is larger than 10 MB.</li>

<li>Should root be allowed to login? Ubuntu/ Debian do not assign a
passwd to root.  Discuss the pro/cons of this choice.</li>

<li>How will you assign a password to root?</li>

<li>What is the purpose of <code>/etc/securetty</code>?  The default installed has
many unnecessary entries.  Trim it.</li>
</ol>
</div>
</div>

<div id="outline-container-org002cd93" class="outline-3">
<h3 id="org002cd93"><span class="section-number-3">2.2</span> Task:  AppArmor and Google Chrome</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li><a href="https://wiki.ubuntu.com/AppArmor">AppArmor</a> is a Mandatory Access Control (MAC) system. This is
installed by default on Ubuntu systems.  Related files are at
<code>/etc/apparmor*</code>.</li>

<li>Install Google Chrome browser for Linux.  Develop an AppArmor
profile for Google Chrome based on the
<code>/etc/apparmor.d/usr.bin.firefox</code> profile.  This should be
your own work.  Include appropriate citations. Do not submit
cut-n-paste of what you may find by googling.</li>
</ol>
</div>
</div>

<div id="outline-container-org56776b3" class="outline-3">
<h3 id="org56776b3"><span class="section-number-3">2.3</span> Task: Examine sudoers, SUID Programs and Scripts</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li><p>
The <code>/etc/sudoers</code> file has a line
</p>
<pre class="example">
root ALL=(ALL:ALL) ALL

</pre>
<p>
Suppose we delete this line.  What privileges does the root user lose?
</p></li>

<li>Out of the 5 users you created (let us call them U1 .. U5), permit
two users, U1 and U2, to be able to <code>mount</code>, <code>umount</code> but no other
priviledged commands.  Assign two users U3 and U4 to group sudo.
Make appropriate changes so that U5 can do everything that root
can.  Explain your work.  Include the revised /etc/sudoers in the
lab pdf.</li>

<li><p>
Discover all suid scripts and programs on LXU.  The following
examines only /bin.
</p>
<pre class="example">
find /bin -user root -perm -4000

</pre></li>

<li>For five of these, write a paragraph either defending its presence
or suggesting its suid status removal.</li>

<li>Does rewriting scripts into programs improve security?  Discuss.</li>
</ol>
</div>
</div>

<div id="outline-container-orga04ddf9" class="outline-3">
<h3 id="orga04ddf9"><span class="section-number-3">2.4</span> Task: Prune Installed Software</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>Take stock of what software is installed on LXU.</li>
<li>Starting from LXU, uninstall at least two packages, without
breaking the installation.  Imagine that LXU is intended for use
only in support of this course.  Why did you choose the two?</li>
</ol>
</div>
</div>

<div id="outline-container-orga716df0" class="outline-3">
<h3 id="orga716df0"><span class="section-number-3">2.5</span> Task: Add System Log  Analyses</h3>
<div class="outline-text-3" id="text-2-5">
<ol class="org-ol">
<li>Linux records various logs in <code>/var/log/*</code>.  There is a log
rotation system.  To be aware of the logs manually is a tedious
task.  There are several log analyses tools that help.  See e.g.,
<ol class="org-ol">
<li><a href="https://www.tecmint.com/best-linux-log-monitoring-and-management-tools/">https://www.tecmint.com/best-linux-log-monitoring-and-management-tools/</a></li>
<li><a href="http://www.pinoylinux.org/system-adminstration/open-source-sysadmin-resources/">http://www.pinoylinux.org/system-adminstration/open-source-sysadmin-resources/</a>
Monitoring and Security sections</li>
</ol></li>

<li>Install and experience a tool of your choice that analyzes log
reports found in <code>/var/log/</code>.</li>

<li>Install the monitoring tool: <code>apt install auditd</code> and then reaad
<code>man auditd</code> .   For an example ruleset, read
<a href="https://security.stackexchange.com/questions/4629/">https://security.stackexchange.com/questions/4629/</a></li>

<li>The <code>auditd</code> package ships with some example configuration files
based on a few standards.  They can be found at
<code>/usr/share/doc/auditd/examples/</code>.  Tailor one example to suit the
needs of this course, as you see fit.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgaa37f26" class="outline-2">
<h2 id="orgaa37f26"><span class="section-number-2">3</span> Optional Bonus Tasks</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org0fc6465" class="outline-3">
<h3 id="org0fc6465"><span class="section-number-3">3.1</span> Task: Revive Bastille Linux Script</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li><a href="https://sourceforge.net/projects/bastille-linux/">https://sourceforge.net/projects/bastille-linux/</a> Bastille Linux is
a script which enhances the security of a Linux box, by configuring
daemons, system settings and firewalling.  It functions on
most major Linux distributions, but has been inactive for
years.</li>

<li>Make this run properly on LXU and submit the report it generates.</li>
</ol>
</div>
</div>

<div id="outline-container-org1a4dfc5" class="outline-3">
<h3 id="org1a4dfc5"><span class="section-number-3">3.2</span> Task: Add Rootkit Detection</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li>Linux systems have not generally experienced virus attacks.  But,
worm attacks, backdoors and rootkits have happened enough times.</li>

<li>Defend your LXU by installing a rootkit detector and schedule its
runs periodically.</li>

<li>Ex: <code>chkrootkit</code>, <code>rkhunter</code></li>
</ol>
</div>
</div>

<div id="outline-container-orgc53fd87" class="outline-3">
<h3 id="orgc53fd87"><span class="section-number-3">3.3</span> Task: [Devious] Rootkit Installation</h3>
<div class="outline-text-3" id="text-3-3">
<ol class="org-ol">
<li><a href="https://packetstormsecurity.com/">https://packetstormsecurity.com/</a> is a whitehat site that hosts the
sources of several exploits and attacks for research.</li>

<li>Find a rootkit source package and make it work within LXU.</li>

<li>E.g., Vlany is a Linux 2016 rootkit "that provides process hiding,
user hiding, network hiding, LXC container, anti-debug,
anti-forensics, persistent reinstalls, dynamic linker
modifications, backdoors, and more."</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org5747ff7" class="outline-2">
<h2 id="org5747ff7"><span class="section-number-2">4</span> Submission</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>You must follow the <a href="../Overview/labReports.html">Lab Report Template</a>.  There should be a section
on each of the tasks.  A couple of lines of an answer to each
(implied/ explicit) question/ discussion item.</li>
<li>Use good judgement and do not make the report way
longer than, say, 20 pages.  Submit explanations and code that
verifies your answers.</li>
<li>The Lab Report should include a section that describes the chosen
LXU briefly, and a detailed section explaining the rationale behind
the changes (what and why) you suggest.</li>
<li>Submit a PDF file named <b>exactly</b> <code>Report-L2.pdf</code>. (Scripts are
used to check various things &#x2013; so file names should obey such
"rules".)</li>
</ol>
</div>
</div>

<div id="outline-container-org1775b1d" class="outline-2">
<h2 id="org1775b1d"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Prabhaker Mateti, <a href="../Fortification/">../Fortification/</a> 2020. Required Reading.</li>
<li>Prabhaker Mateti, <a href="../KernelExploits/RootKits/">../KernelExploits/RootKits/</a>.  2019. Required Reading.</li>

<li>wikipedia.org,
<a href="http://en.wikipedia.org/wiki/Category:Linux_security_software">http://en.wikipedia.org/wiki/Category:Linux_security_software</a> 2020.
Required Visit.</li>

<li><a href="https://www.howtogeek.com/118222/htg-explains-what-apparmor-is-and-how-it-secures-your-ubuntu-system/">What Is AppArmor, and How Does It Keep Ubuntu Secure?</a> by Chris
Hoffman on September 28th, 2016.  Required Reading.</li>

<li>Jay Beale,   <a href="https://www.symantec.com/connect/articles/bastille-linux-walkthrough">bastille-linux-walkthrough</a> 2000. Recommended
Reading.</li>
</ol>
</div>
</div>


<div id="outline-container-org75d0481" class="outline-2">
<h2 id="org75d0481"><span class="section-number-2">6</span> End</h2>
<div class="outline-text-2" id="text-6">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2020 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2020-09-15
</div>
</body>
</html>
